#include<stdio.h>  
#include<windows.h>  
#include<conio.h>  
#include<math.h>  
//____________________________  
#define N 100//产生随即颜色   
//________________________________________________________________________________________________________________  
extern char s_1[]={"☆ 我为您收集了编程所有的美，放在您生日的烛台上。将能说的话都藏在花蕾里，让它成为待放的秘密。"};  
extern char s_2[]={"☆ 一碗甜甜的长寿面，筋斗的面条是我长长的祝愿，一丝丝将您缠绕到永远，愿健康和快乐、幸福和甜蜜与您日夜相伴，祝您生日快乐！"};  
extern char s_3[]={"☆ 愿我的心是一朵鲜花，盛开在您的天空下，为您的生日增添一点温馨的情调，为您的快乐增添一片美丽的光华！"};  
extern char s_4[]={"☆ 在这个值得庆贺的日子里，我虽无鲜花与美酒献礼，但心中有歌，谨祝您一生快乐。"};  
extern char s_5[]={"☆ 绿色是生命的颜色，绿色的浪漫是生命的浪漫。因此，我选择了这个绿色的世界，馈赠给您的生日。愿您充满活力，青春常在。"};  
extern char s_6[]={"☆ 当吹生日蜡烛的时候我许下心愿，当流星划过天际的时候我许下心愿，当写这个程序的时候我也许下心愿：愿正在看这个程序的人一生幸福快乐！"};  
extern char s_7[]={"☆ 您用优美的年轮编成一册散发油墨清香的日历，年年我都会在日历的这一页上用深情的想念祝福您的生日！"};  
extern char s_8[]={"☆ 在您生日的这一天，将快乐的音符，作为礼物送给您，愿您拥有365个美丽的日子，衷心地祝福您--生日快乐！"};  
extern char s_9[]={"☆ 一生中总有一些朋友难忘记；一年中总有一些日子最珍惜；由陌生转为熟悉；虽不能时时问候；在特别的日子里祝您生日快乐！"};  
extern char s_10[]={"☆ 只有懂得生活的人，才能领略鲜花的娇艳，只有懂得爱的人，才能领略到心中芬芳，祝您有一个特别的生日。"};  
extern char s_11[]={"☆ 日月轮转永不断，情若真挚长相伴，不论您身在天涯海角，我将永远记住这一天。祝您生日快乐！"};  
extern char s_12[]={"☆ 在这个充满喜悦的日子里，衷心祝愿您青春长驻，愿将一份宁静和喜悦悄悄带给您，生日快乐！"};  
extern char s_13[]={"☆ 幸福、愉快、欢乐都由您的生日而来，我把至诚的祝福化成一个美丽的谜，带到您的生日宴会上来，让您猜……"};  
extern char s_14[]={"☆ 喂！亲友，今天是您的大生日！在这个时刻，我要送给您千万个嘱咐与问候，这是最值钱的\"寒酸\"！"};  
extern char s_15[]={"☆ 两片绿叶，饱含着它同根生的情谊；一句贺词，浓缩了我对您的祝福。愿快乐拥抱您，在这属于您的特别的一天，生日快乐！"};  
extern char s_16[]={"☆ 祈望您心灵深处--芳草永绿，青春常驻，笑口常开。祝您生日快乐！\n"};  
extern char s_17[]={"                           祝您永远幸福快乐！\n\n虽不知我是不是你心中的那个彼此欣赏的知己，但我知道你是我最最喜欢的红颜\n                 愿您始终以自己喜欢方式，宠爱自己一生!!\n\n                           虽然我们相识的日子还是短暂的\n                           可是我已深深把你来爱了\n                           你的天真和你的纯情已把我吸引了\n                           你就是我梦中美丽的天使\n                           我知道你是一个天真善良温柔的女孩\n                           真的希望自己能够配上你\n                           如果你能给我机会让我好好的爱你\n                           真的只想真心真意对你说\n                           我爱你一定爱到花都开了鸟儿把歌唱\n                           爱到牛郎织女为我们点头\n                           爱到花儿绽放鸟儿成群把我们环绕\n                           爱到每道彩虹映出你的美\n                           我爱你一定爱到海枯石烂永远不后悔\n                           爱到来生来世也会说无悔\n                           就把这首动听的歌唱给心爱的女孩\n                           真的希望你能给我个机会\n                           让我去爱你\n"};  
extern char s_18[]={"                                                                hsyl007"};  
extern char s_19[]={"                                                                18.4.17"};
extern char s_20[]={"                          ★生日快乐!★"};  
extern char * ssum[]={s_1,s_2,s_3,s_4,s_5,s_6,s_7,s_8,s_9,s_10,s_11,s_12,s_13,s_14,s_15,s_16,s_17,s_18,s_19};  
//________________________________________________________________________________________________________________  
char randk();  
void main(){  
        int i=0;  
        long f=0;  
        char s[10]="color ";  
        puts("\n\n\n\n\n\n\n\n\n\n ");  
        for(i=0;i<99;i++)
		{//要变色的次数  
          s[6]=randk();s[7]=randk();  
          system(s);//调用cmd的color命令  
          printf("\r                        ★生日快乐!★\n\n\n");
		  printf("\r                         iiiiiiiiii\n");
		  printf("\r                        |:H:a:p:p:y:| \n");
		  printf("\r                      i_|___________|_i\n");
		  printf("\r                     |^^^^^^^^^^^^^^^^^|\n");
		  printf("\r                     |:B:i:r:t:h:d:a:y:|\n");
		  printf("\r                     |_______Ling______|\n\n\n");
		  float y, x, z, f;
		  for (y = 1.5f; y > -1.5f; y-=0.1f)
		  {
			  for (x = -1.5f; x < 1.5f; x += 0.05f)
			  {
				  z = x*x + y*y -1;
				  f = z*z*z - x*x*y*y*y;
				  putchar(f <= 0.0f ? "*********"[(int)(f*-8.0f)]:' ');
			  }putchar('\n');
		  }
          f=0;  
          while(f<5201314)f=f+1;  
        }  
  
        puts("玲妹妹:\n");  
        s[6]='d';//背景为d淡红色  
          
        //输出要说的话  
        for(i=0;i<20;i++){//为要输出的行数  
                puts("\n\a");  
                s[7]=randk();  
                system(s);//调用cmd的color命  
                puts(*(ssum+i));  
                f=0;  
                while(f<520131466){  
                         f=f+1;  
                         f=f-1;  
                         f=f+1;  
                }  
  
        }  
  
        getchar();
		system("pause");
  
}  
  
char randk(){//产生随即颜色  
        char a=0;  
        a=(char) abs( rand()%16);  
        if(a >=10){  
          a-=10;  
          a+=97;  
        }else a+=48;  
          
        return a;  
}  
