
void display()//显示主菜单
{
	system("cls");
	cout << "*********************************************************************************************************************" << endl;
    cout << "*                                                     12学生食堂                                                    *" << endl;
    cout << "*                ______________________________________|_______________________________                             *" << endl;
    cout << "*               |                  |                   |                  |            |                            *" << endl;
    cout << "*               |      球场        |      学生宿舍区   |  学生宿舍区      |            |      操场                  *" << endl;
    cout << "*               | _________________|___________________|__________________|____________|_____________  学校后门     *" << endl;
	cout << "*               |                  |                   |                       13校医院     14商业街                *" << endl;
	cout << "*               |                  |                   |                                                            *" << endl;
	cout << "*               |                  |   11学生宿舍区    |                                                            *" << endl;
	cout << "*       10体育场|                  |                   |                                                            *" << endl;
	cout << "*               |                  |                   |                                                            *" << endl;
	cout << "*               |                  |                   |                                                            *" << endl;
	cout << "*               |                  |                   |                                                            *" << endl;
	cout << "*               |                  |                   |                                                            *" << endl;
	cout << "*  7陈毅纪念馆  |      8图书馆     |9文澄楼         ___|                    教师公寓                                *" << endl;
	cout << "*       ________|__________________|               |   |                                                            *" << endl;
	cout << "*               |        |         |               |   |                                                            *" << endl;
	cout << "*               |        |         |               |   |                                                            *" << endl;
	cout << "*               |        |         |               |   |                                                            *" << endl;
	cout << "*               |        |         |5允明楼 6零号楼|   |                                                            *" << endl;
	cout << "*       4德五楼 |________|_________|_______________|   |                                                            *" << endl;
	cout << "*               |        |         |                   |                                                            *" << endl;
	cout << "*               |        |         |                   |                                                            *" << endl;
	cout << "*               |        |         |                   |             学生宿舍                                       *" << endl;
	cout << "*               |        |         | 3长虹会堂         |                                                            *" << endl;
	cout << "*  1实习工厂____|________|_________|___________________|                                                            *" << endl;
	cout << "*                        |                                                                                          *" << endl;
	cout << "*                     2学校正门                                                                                     *" << endl;
	cout << "*                                                                                                                   *" << endl;
	cout << "*                                        欢迎来到成都工业学院导航系统                                               *" << endl;
	cout << "*                                               1.添加景点                                                          *" << endl;
	cout << "*                                               2.修改景点信息                                                      *" << endl;
	cout << "*                                               3.删除景点信息                                                      *" << endl;
	cout << "*                                               4.查询景点信息                                                      *" << endl;
	cout << "*                                               5.查询路径                                                          *" << endl;
	cout << "*                                               6.退出系统                                                          *" << endl;
    cout << "*********************************************************************************************************************" << endl;
	cout << "请输入选择：" << endl;
	int n;
	cin >> n;
	switch (n)
	{
	case 1:break;
	case 2:break;
	case 3:break;
	case 4:break;
	
	}
}
